/*^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
 *
 * 以下の配列は修正完了後です
 * 引数に渡す前に、誤った記法にしてください
 * 
 ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^*/
const argArray = [
  "#    マークダウンの校正アイデア",
  "",
  " 参考 url",
  " https://qiita.com/tbpgr/items/989c6badefff69377da7",
  "**まず初めにインデントの統一をする**",
  "",
  " ##見出し",
  "",
  "###修正",
  "",
  "-     1",
  "  - 2",
  "    -3",
  "",
  " 1. a",
  "    2.b",
  "     1.c",
  "         - c",
  "",
  "       1.c",
  "       - c",
  "    1.c",
  " 1. a",
  "    - b",
  "     - c",
  "         - c",
  "",
  "         - c",
  "        1.c",
  "      1.c",
  "- a",
  "   - a",
  "   - a",
  "    - a",
  "     - a",
  "      - a",
  "       - a",
  "      - a",
  "     - a",
  "    - a",
  "  - a",
  ">>>>>>>      123",
  " >  12",
  "",
  ">>1",
  ">>a",
  ">> b",
];

const argStr =
  "#    マークダウンの校正アイデア\n\n参考 url\rhttps://qiita.com/tbpgr/items/989c6badefff69377da7\n**まず初めにインデントの統一をする**\r\r##見出し\n\n###修正\n\n-     1\n  - 2\n    -3\n\n1. a\n2.b\n3.c\n>>>>>>>      123\n>  12\n\n>>1\n>>a\n>> b";

export { argArray, argStr };
